TIME_SLOTS = [
    "8:00 - 9:35",
    "9:45 - 11:20",
    "11:30-13:05",
    "13:25-15:00",
    "15:10-16:45",
    "16:55-18:30",
    "18:40-20:00",
    "20:10-21:30"
]

WEEKDAYS_RU = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"]
WEEKDAYS_EN = ["monday", "tuesday", "wednesday", "thursday", "friday", "saturday"]
WEEKDAY_MAP = dict(zip(WEEKDAYS_EN, WEEKDAYS_RU))

ALL_ROOMS = sorted([
    '290', '291', '292', '293', '295', '297',
    '301П', '303П', '305П', '307П', '308П', '309П', '314П', '316П',
    '380', '381', '382', '383', '384', '385', '387',
    '403П', '407П',
    '477', '479', '480', '505П'
])